lab8/requests/events/createEvent.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="pl/pwr/java/lab8/soap/events">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:createEventRequest>
            <event>
                <id>0</id>
                <name>"Wielka Libacja na koniec szkoły"</name>
                <place>"Plac Teatralny"</place>
                <date>2021-04-29+02:00</date>
            </event>
        </gs:createEventRequest>
    </soapenv:Body>
</soapenv:Envelope>